Minimal example:
```hcl
resource "aws_launch_template" "this" {
  name_prefix   = "test"
  image_id      = "ami-011c865bf7da41a9d"
  instance_type = "m5.large"

  placement {
    tenancy    = "default"
    group_name = aws_placement_group.test.id
  }
}

resource "aws_autoscaling_group" "this" {
  name_prefix        = "test"
  availability_zones = ["us-east-1a"]
  desired_capacity   = 1
  min_size           = 1
  max_size           = 3

  launch_template {
    id      = aws_launch_template.this.id
    version = "$Latest"
  }
}

resource "aws_placement_group" "test" {
  name     = "test"
  strategy = "cluster"
}

provider "aws" {
  region = "us-east-1"
}
```

Output:
```
Terraform will perform the following actions:

  # aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "us-east-1a",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "test"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-011c865bf7da41a9d"
      + instance_type   = "m5.large"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "test"

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = "default"
        }
    }

  # aws_placement_group.test will be created
  + resource "aws_placement_group" "test" {
      + id                 = (known after apply)
      + name               = "test"
      + placement_group_id = (known after apply)
      + strategy           = "cluster"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_placement_group.test: Creating...
aws_placement_group.test: Creation complete after 1s [id=test]
aws_launch_template.this: Creating...
aws_launch_template.this: Creation complete after 2s [id=lt-01059bd14a1f3f2d7]
aws_autoscaling_group.this: Creating...

Error: Error creating AutoScaling Group: ValidationError: You must use a valid fully-formed
launch template. You cannot use PartitionNumber with a Placement Group that does not
use the 'partition' strategy. Placement Group 'test' uses 'cluster' strategy. Specify a
different Placement Group and try again.
	status code: 400, request id: 186d3713-b9e4-4d0b-8309-904d701a7ff5

  on main.tf line 16, in resource "aws_autoscaling_group" "this":
  16: resource "aws_autoscaling_group" "this" {
```

```
Terraform v0.12.24
+ provider.aws v2.61.0
```

Not sure if this is a provider or aws-sdk-go issue. Something is setting `partition_number` to 0 which is invalid in all use cases.

Trace: https://gist.github.com/dpiddockcmp/3e48d01bf8744467133b1734c98e87b8